Revit 2026 API

# DoubleArrayIterator Methods

---

The DoubleArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

DoubleArrayIterator Class

Autodesk.Revit.DB Namespace